04_OpenFoam/_Tut_02/OpenFOAM-14/fluid/annularThermalMixer/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        rotating;

    solidBodyMotionFunction
    {
        type        rotatingMotion;

        origin      (0 0 0);
        axis        (0 0 1);
        omega       $!meshMotionProperties/omega;
    }
}


// ************************************************************************* //
