04_OpenFoam/_Tut_02/OpenFOAM-14/fluid/annularThermalMixer/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [turbulentKineticEnergy];

internalField   uniform $!innerInlet/k;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    innerInlet
    {
        type            fixedValue;
        value           uniform $!innerInlet/k;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $!outerInlet/k;
    }

    outlet
    {
        $!outlet/k;
    }

    staticWalls
    {
        $!wall/k;
    }

    movingWalls
    {
        $staticWalls;
    }

    nonCouple
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
