04_OpenFoam/_Tut_02/OpenFOAM-14/fluid/annularThermalMixer/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceFeatures

runApplication blockMesh
runApplication snappyHexMesh

runApplication createBaffles
runApplication splitBaffles
runApplication createNonConformalCouples nonCouple1 nonCouple2

runApplication foamRun

#------------------------------------------------------------------------------
